<template>
  <div id="main2">
    <div>
      <img src="../../image/main-2.jpg" alt="" />
    </div>
    <h4>软件测试工程师工作内容有哪些?</h4>
    <p>
      软件工程师的工作内容主要就是进行软件以及系统的测试了，那么具体的测试工作则分为以下几个部分：
    </p>
    <h4>一、需求评审</h4>

    <p>
      在整个团队拿到需求之后的第一件事是进行需求分析，看看要这个软件要实现哪些需求。需求分析的后一步就是需求评审了，这个环节需要软件测试工程师与产品需求人员、开发人员、QA人员共同进行参与，评审这些需求能不能够实现。
    </p>
    <h4>二、写测试计划</h4>
    <p>
      接下来在开发人员编写开发计划的同时，测试人员要写测试计划，就是哪些人要在什么时间做哪些测试工作，最后产出什么工作结果也就是提交哪些文档。
    </p>
    <h4>三、编写测试用例</h4>
    <p>
      测试用例就是指导测试工作进行的文档，比如要测试系统的登录功能、购买功能等，会通过测试方法和策略来设计测试用例。所以编写测试用例是软件测试工程师进行测试之外最重要的工作了。
    </p>
    <h4>四、用例评审</h4>
    <p>
      用例评审就是评价和审查测试方法和测试内容是否合理全面。不能只做基础的测试工作就可以，还得全面进行可能会出现各种各样错误的测试，尽可能把bug降到最低。
    </p>
    <h4>五、执行测试、提交bug</h4>
    <p>
      执行测试自然不必多说，就是测试工程师真刀真枪地进行测试工作，找出了bug之后会进行提交，让软件开发人员进行修改。
    </p>
    <h4>六、回归测试、编写测试总结报告</h4>
    <p>
      回归测试就是对开发人员改好bug的软件再次进行测试，看bug是否都已经修改好。待bug都修改好之后，测试人员要编写测试总结报告，阐述软件的质量如何，软件才可以上线发布。
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
#main2 {
  width: 80%;
  margin: 0 auto;
  h4 {
    text-indent: 2em;
    margin: 10px 0;
  }
  p {
    text-indent: 2em;
  }
  img {
    margin-left: 100px;
  }
}
</style>