<template>
  <div id="main3">
    <h3>软件工程的就业方向是什么？</h3>
    <p>
      随着“互联网+”的兴起，许多行业都离不开互联网，离不开软件工程专业的人才。该专业的就业方向主要是做技术、设计等方面。
      例如，软件产品的开发，软件的测试、安装与维护，办公自动化处理和网页制作，网站的开发和管理等。另外，5G标准的出炉，将会持续带动未来软件工程行业的发展，从这个角度来看，软件工程专业的就业前景值得期待。
    </p>
    <p>
      在许多人的认知里，软件工程毕业的学生出来工作后，就成为了人们口中的程序员。但是程序员也分为很多种，下面举一些热门的职业以供大家更好了解软工就业方向，从而理解什么是选择软工走向成功，实现0-20000的蜕变。
    </p>
    <h4>前端设计师：</h4>
    <p>
      我们在浏览网站时，会看到一些科技感十足，画面十分精致的网页，也会看到一些粗制滥造、仿佛回到10年前的页面。所有的这些，都是出自前端之手，他们负责在实现网站具体功能的同时加入一些互动和特效，和前端联系比较紧密的是UI设计师。但是UI设计师相关的知识软件工程大多是不教的。UI设计师的工作就是设计出比较好看的界面和图标，合理的页面布局等，需要掌握一些专业的设计软件。
    </p>
    <div><img src="../../image/main3-content1.jpg" alt="图片不存在" /></div>
    <h4>后端开发工程师：</h4>
    <p>
      如果说前端是负责网页页面的实现，那么后端的任务则是网页后台数据的处理。例如你在登陆一个网页时，要输入账号与密码，后端就要将你输入的信息与数据库进行访问并返回结果。
    </p>
    <h4>人工智能工程师：</h4>
    <p>
      作为时下最热门的职业之一，人工智能工程师岗位的要求也是相对较高的，它需要有较高的数学水平和编码能力，我们身边的app里大都有人工智能的痕迹，例如路线规划、喜好推荐、人脸识别等功能，其实都是人工智能的功劳。
    </p>
    <div><img src="../../image/main3-content2.jpg" alt="图片不存在" /></div>
    <p>
      如果你觉得这些岗位都对写代码能力的要求太高，那么你也可以考虑做软件测试、运行维护。又或者你对游戏感兴趣，也可以选择做一名游戏开发者。
      软件工程毕业的学生完全可以凭自己的兴趣，选择一个自己最喜欢的职业，为之努力。
    </p>
    <div><img src="../../image/main3-content3.jpg" alt="图片不存在" /></div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
#main3 {
  width: 80%;
  margin: 0 auto;
  h3,
  h4 {
    text-indent: 2em;
    margin: 10px 0;
  }
  p {
    text-indent: 2em;
  }
  img {
    margin: 20px 0;
    margin-left: 100px;
  }
}
</style>