<template>
  <div id="main1">
    <div><img src="../../image/main-1.jpg" alt="图片不存在" /></div>
    <h3>软件工程专业主要学习什么？</h3>
    <p>
      软件工程主要是学程序设计语言、数据库、软件开发工具、系统平台、设计模式等方面。
    </p>
    <h4>软件主干学科包括：</h4>
    <p>
      马克思主义理论、大学外语、高等数学、大学物理、物理实验、线性代数、概率论与数理统计、程序设计语言、数据结构、离散数学、操作系统、编译技术、软件工程概论、统一建模语言、软件体系结构、软件需求、软件项目管理。
      该专业除了学习公共基础课外，还将系统学习离散数学、数据结构、算法分析、面向对象程序设计、现代操作系统、数据库原理与实现技术、编译原理、软件工程、软件项目管理、计算机安全等课程，根据学生的兴趣还可以选修一些其它选修课。
    </p>
    <h4>哪些地方可以运用到软件工程知识呢？</h4>
    <p>
      毕业实习、课程设计、计算机工程实践、生产实习、毕业设计(论文)里面都可以使用到软件工程的知识哦！
    </p>
    <div>
      <img src="../../image/main1-content1.jpg" alt="图片不存在" />
    </div>
    <h4>软件工程的目标是：</h4>

    （1）适用性：软件在不同的系统约束条件下，使用户需求得到满足的难易程度。
    <br />
    （2）有效性：软件系统能最有效的利用计算机的时间和空间资源。各种软件无不把系统的时/空开销作为衡量软件质量的一项重要技术指标。很多场合，在追求时间有效性和空间有效性时会发生矛盾，这时不得不牺牲时间有效性换取空间有效性或牺牲空间有效性换取时间有效性。时/空折衷是经常采用的技巧。
    <br />
    （3）可修改性：允许对系统进行修改而不增加原系统的复杂性。它支持软件的调试和维护，是一个难以达到的目标。
    <br />
    （4）可靠性：能防止因概念、设计和结构等方面的不完善造成的软件系统失效，具有挽回因操作不当造成软件系统失效的能力。
    <br />
    （5）可理解性：系统具有清晰的结构，能直接反映问题的需求。可理解性有助于控制系统软件复杂性，并支持软件的维护、移植或重用。
    <br />
    （6）可维护性：软件交付使用后，能够对它进行修改，以改正潜伏的错误，改进性能和其它属性，使软件产品适应环境的变化等。软件维护费用在软件开发费用中占有很大的比重。可维护性是软件工程中一项十分重要的目标。
    <br />
    （7）可重用性：把概念或功能相对独立的一个或一组相关模块定义为一个软部件。可组装在系统的任何位置，降低工作量。
    <br />
    （8）可移植性：软件从一个计算机系统或环境搬到另一个计算机系统或环境的难易程度。
    <br />
    （9）可追踪性：根据软件需求对软件设计、程序进行正向追踪，或根据软件设计、程序对软件需求的逆向追踪的能力。
    <br />
    （10）可互操作性：多个软件元素相互通信并协同完成任务的能力。 <br />
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
#main1 {
  width: 80%;
  margin: 0 auto;
  h3,
  h4 {
    text-indent: 2em;
    margin: 10px 0;
  }
  p {
    text-indent: 2em;
  }
  img {
    margin-left: 100px;
  }
}
</style>